Repository: CofficLab/Lumi
Catalog: Packages/PluginGit/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: .gitignore: view and edit the ignore rules of the repository.
zh_hans: .gitignore:查看与编辑仓库的忽略规则。
zh_hk: .gitignore:查看與編輯儲存庫的忽略規則。

source: (missing)
zh_hans: （缺失）
zh_hk: （缺失）

source: %lld days ago
zh_hans: %lld 天前
zh_hk: %lld 天前

source: %lld hours ago
zh_hans: %lld 小时前
zh_hk: %lld 小時前

source: %lld minutes ago
zh_hans: %lld 分钟前
zh_hk: %lld 分鐘前

source: %lld months ago
zh_hans: %lld 个月前
zh_hk: %lld 個月前

source: %lld years ago
zh_hans: %lld 年前
zh_hk: %lld 年前

source: A project must be open; the Git tabs are hidden when no project is open.
zh_hans: 需先打开项目;未打开项目时 Git 标签页不会显示。
zh_hk: 需先開啟專案;未開啟專案時 Git 標籤頁不會顯示。

source: Abort merge
zh_hans: 中止合并
zh_hk: 中止合併

source: Add .gitignore
zh_hans: 添加 .gitignore
zh_hk: 添加 .gitignore

source: Agent tools
zh_hans: Agent 工具
zh_hk: Agent 工具

source: AI generates commit message
zh_hans: AI 自动生成 commit 信息
zh_hk: AI 自動生成 commit 訊息

source: AI returned empty response
zh_hans: AI 返回内容为空
zh_hk: AI 返回內容為空

source: All changes committed
zh_hans: 所有更改已提交
zh_hk: 所有更改已提交

source: Apply
zh_hans: 应用
zh_hk: 套用

source: Auto Push
zh_hans: 自动推送
zh_hk: 自動推送

source: Auto Push: push commits automatically after committing.
zh_hans: 自动推送:提交后自动推送提交。
zh_hk: 自動推送:提交後自動推送提交。

source: Basic Operations
zh_hans: 基本操作
zh_hk: 基本操作

source: Branch Management
zh_hans: 分支管理
zh_hk: 分支管理

source: Branch name
zh_hans: 分支名称
zh_hk: 分支名稱

source: Branches
zh_hans: 分支
zh_hk: 分支

source: Browse commits with relative dates, authors and statistics.
zh_hans: 按相对日期浏览提交、作者与统计信息。
zh_hk: 按相對日期瀏覽提交、作者與統計資訊。

source: Cancel
zh_hans: 取消
zh_hk: 取消

source: Cannot display diff for this file
zh_hans: 无法显示此文件的差异
zh_hk: 無法顯示此檔案的差異

source: Checkout Failed:
zh_hans: 切换失败：
zh_hk: 切換失敗：

source: Clean
zh_hans: 干净
zh_hk: 乾淨

source: Clean working tree
zh_hans: 工作区干净
zh_hk: 工作區乾淨

source: Clean Working Tree
zh_hans: 工作区干净
zh_hk: 工作區整潔

source: Clean Workspace
zh_hans: 清理工作区
zh_hk: 清理工作區

source: Clear all
zh_hans: 全部清空
zh_hk: 全部清空

source: Click Commit to commit the current changes.
zh_hans: 点击「提交」以提交当前变更。
zh_hk: 點擊「提交」以提交目前變更。

source: Commit
zh_hans: 提交
zh_hk: 提交

source: Commit changes
zh_hans: 提交变更
zh_hk: 提交變更

source: Commit History
zh_hans: 提交历史
zh_hk: 提交歷史

source: Commit input
zh_hans: 提交输入
zh_hk: 提交輸入

source: Commit input: the message field with the AI button, which generates a commit message, and the Commit button.
zh_hans: 提交输入:提交信息输入框、「AI」按钮(用于自动生成提交信息)与「提交」按钮。
zh_hk: 提交輸入:提交訊息輸入框、「AI」按鈕(用於自動產生提交訊息)與「提交」按鈕。

source: Committed: %@
zh_hans: 已提交：%@
zh_hk: 已提交：%@

source: Conflicts: inspect and resolve merge conflicts.
zh_hans: 冲突:检视并解决合并冲突。
zh_hk: 衝突:檢視並解決合併衝突。

source: Contributors
zh_hans: 贡献者
zh_hk: 貢獻者

source: Core Capabilities
zh_hans: 核心能力
zh_hk: 核心能力

source: Create
zh_hans: 创建
zh_hk: 建立

source: Create Branch Failed:
zh_hans: 创建分支失败：
zh_hk: 建立分支失敗：

source: Create New Branch
zh_hans: 创建新分支
zh_hk: 建立新分支

source: Create, switch and manage branches.
zh_hans: 创建、切换与管理分支。
zh_hk: 建立、切換與管理分支。

source: Current Branch
zh_hans: 当前分支
zh_hk: 目前分支

source: Current status
zh_hans: 当前状态
zh_hk: 當前狀態

source: Detail area
zh_hans: 详情区
zh_hk: 詳情區

source: Detail area: shows the working state, the repository stats (Total Commits, Contributors, Latest Commit), and the diff of the selected commit.
zh_hans: 详情区:显示工作状态、仓库统计(总提交数、贡献者数、最新提交)以及所选提交的差异。
zh_hk: 詳情區:顯示工作狀態、儲存庫統計(總提交數、貢獻者數、最新提交)以及所選提交的差異。

source: Diff
zh_hans: 差异
zh_hk: 差異

source: Diff Review
zh_hans: 差异审查
zh_hk: 差異檢視

source: Drop
zh_hans: 删除
zh_hk: 刪除

source: Enable auto push
zh_hans: 启用自动推送
zh_hk: 啟用自動推送

source: Enter a commit message in the field; click AI to generate one automatically.
zh_hans: 在输入框中填写提交信息;点击「AI」可自动生成。
zh_hk: 在輸入框中填寫提交訊息;點擊「AI」可自動產生。

source: Enter commit message...
zh_hans: 输入 commit 信息...
zh_hk: 輸入 commit 訊息...

source: Explore history, diffs, branches and commits — with six Git tools in the sidebar.
zh_hans: 查看历史、差异、分支与提交，侧边栏内还集成了六个 Git 工具。
zh_hk: 查看歷史、差異、分支與提交，側邊欄內還整合了六個 Git 工具。

source: Fetch Failed:
zh_hans: 拉取失败：
zh_hk: 拉取失敗：

source: Fetch LFS objects
zh_hans: 拉取 LFS 对象
zh_hk: 拉取 LFS 物件

source: Figure 1: Interface layout
zh_hans: 图 1 界面布局
zh_hk: 圖 1 介面佈局

source: files
zh_hans: 个文件
zh_hk: 個檔案

source: Git history panel in the sidebar
zh_hans: 侧边栏中的 Git 历史面板
zh_hk: 側邊欄中的 Git 歷史面板

source: Git Information
zh_hans: Git 信息
zh_hk: Git 資訊

source: Git LFS is not enabled in this repository. Install hooks to enable large file tracking.
zh_hans: 当前仓库未启用 Git LFS。安装钩子以启用大文件跟踪。
zh_hk: 當前倉庫未啟用 Git LFS。安裝勾選以啟用大檔案追蹤。

source: Git tools
zh_hans: Git 工具
zh_hk: Git 工具

source: History
zh_hans: 历史
zh_hk: 歷史

source: History sidebar
zh_hans: 历史侧栏
zh_hk: 歷史側欄

source: History sidebar: the current status (clean working tree or the number of uncommitted files) followed by the commit list with relative dates.
zh_hans: 历史侧栏:顶部为当前状态(工作树干净或未提交文件数),下方为带相对时间的提交列表。
zh_hk: 歷史側欄:頂部為目前狀態(工作樹乾淨或未提交檔案數),下方為帶相對時間的提交列表。

source: Init all
zh_hans: 全部初始化
zh_hk: 全部初始化

source: Insert template:
zh_hans: 插入模板：
zh_hk: 插入模板：

source: Inspect additions and deletions of any commit or file.
zh_hans: 查看任意提交或文件的新增与删除。
zh_hk: 查看任意提交或檔案的新增與刪除。

source: Install LFS hooks
zh_hans: 安装 LFS 钩子
zh_hk: 安裝 LFS 勾選

source: Interface
zh_hans: 界面说明
zh_hk: 介面說明

source: Interval
zh_hans: 间隔
zh_hk: 間隔

source: Invalid Branch Name:
zh_hans: 无效的分支名称：
zh_hk: 無效的分支名稱：

source: Just now
zh_hans: 刚刚
zh_hk: 剛剛

source: Latest Commit
zh_hans: 最新提交
zh_hk: 最新提交

source: LFS: manage the large file storage of the repository.
zh_hans: LFS:管理仓库的大文件存储。
zh_hk: LFS:管理儲存庫的大檔案儲存。

source: LLM not configured
zh_hans: 未配置 LLM
zh_hk: 未設定 LLM

source: Loading diff...
zh_hans: 正在加载差异...
zh_hk: 正在載入差異...

source: Loading...
zh_hans: 正在加载...
zh_hk: 正在載入...

source: Manage nested repositories.
zh_hans: 管理嵌套仓库。
zh_hk: 管理巢狀儲存庫。

source: Mark as resolved
zh_hans: 标记为已解决
zh_hk: 標記為已解決

source: Merge conflicts
zh_hans: 合并冲突
zh_hk: 合併衝突

source: Merge Conflicts
zh_hans: 合并冲突
zh_hk: 合併衝突

source: Min unpushed commits
zh_hans: 最少未推送提交数
zh_hk: 最少未推送提交數

source: No active merge conflicts.
zh_hans: 当前无合并冲突。
zh_hk: 當前無合併衝突。

source: No changes to commit
zh_hans: 没有需要提交的变更
zh_hk: 沒有需要提交的變更

source: No file changes in this commit
zh_hans: 此提交中没有文件更改
zh_hk: 此提交中沒有檔案變更

source: No LFS-tracked files yet.
zh_hans: 暂无 LFS 跟踪的文件。
zh_hk: 暫無 LFS 追蹤的檔案。

source: No stashes yet
zh_hans: 暂无暂存
zh_hk: 暫無暫存

source: No submodules in this repository.
zh_hans: 当前仓库无子模块。
zh_hk: 當前倉庫無子模組。

source: Not a Git Repository
zh_hans: 不是 Git 仓库
zh_hk: 不是 Git 儲存庫

source: Not pushed to remote repository
zh_hans: 未推送到远程仓库
zh_hk: 未推送到遠端儲存庫

source: Notes
zh_hans: 注意事项
zh_hk: 注意事項

source: Only push when working tree is clean
zh_hans: 仅在工作区干净时推送
zh_hk: 僅在工作區乾淨時推送

source: Optional message
zh_hans: 可选说明
zh_hk: 可選說明

source: Overview
zh_hans: 概述
zh_hk: 概述

source: Please select a commit from the sidebar
zh_hans: 请从侧边栏选择一个提交
zh_hk: 請從側邊欄選擇一個提交

source: Please select a project first
zh_hans: 请先选择一个项目
zh_hk: 請先選擇一個項目

source: Pop
zh_hans: 弹出
zh_hk: 彈出

source: Prune local cache
zh_hans: 清理本地缓存
zh_hk: 清理本機快取

source: Push commits automatically after committing.
zh_hans: 提交后自动推送。
zh_hk: 提交後自動推送。

source: Push now
zh_hans: 立即推送
zh_hk: 立即推送

source: Remote name
zh_hans: 远端名称
zh_hk: 遠端名稱

source: Save
zh_hans: 保存
zh_hk: 儲存

source: Save and restore uncommitted changes.
zh_hans: 保存并恢复未提交的更改。
zh_hk: 儲存並還原未提交的變更。

source: Search branches...
zh_hans: 搜索分支...
zh_hk: 搜尋分支...

source: Select a commit to view its changes in the diff.
zh_hans: 选择一个提交,在差异视图中查看其变更。
zh_hk: 選擇一個提交,在差異視圖中查看其變更。

source: Select a file to view diff
zh_hans: 选择一个文件以查看差异
zh_hk: 選擇一個檔案以查看差異

source: Sidebar tabs
zh_hans: 侧边栏页签
zh_hk: 側邊欄頁籤

source: Start
zh_hans: 启动
zh_hk: 啟動

source: Stash
zh_hans: 暂存
zh_hk: 暫存

source: Stash, .gitignore and LFS status bar tiles
zh_hans: 状态栏中的 Stash、.gitignore 与 LFS 快捷入口
zh_hk: 狀態列中的 Stash、.gitignore 與 LFS 快捷入口

source: Stash: save and restore uncommitted changes.
zh_hans: 贮藏:保存与恢复未提交的变更。
zh_hk: 貯藏:保存與復原未提交的變更。

source: Stashes
zh_hans: 暂存列表
zh_hk: 暫存列表

source: Status
zh_hans: 状态
zh_hk: 狀態

source: Stop
zh_hans: 停止
zh_hk: 停止

source: Submodule: view and manage the submodules of the repository.
zh_hans: 子模块:查看与管理仓库的子模块。
zh_hk: 子模組:查看與管理儲存庫的子模組。

source: Submodules
zh_hans: 子模块
zh_hk: 子模組

source: The AI button requires a configured language model.
zh_hans: 「AI」按钮需要已配置的语言模型。
zh_hk: 「AI」按鈕需要已設定的語言模型。

source: This manual covers the interface and basic operations of the Git panel: viewing the commit history, inspecting changes, and committing.
zh_hans: 本手册介绍 Git 面板的界面与基本操作:查看提交历史、检视变更并进行提交。
zh_hk: 本手冊介紹 Git 面板的介面與基本操作:查看提交歷史、檢視變更並進行提交。

source: Tools
zh_hans: 工具
zh_hk: 工具

source: Tools panel with six utilities
zh_hans: 包含六个工具的工具面板
zh_hk: 包含六個工具的工局面板

source: Tools tab: a segmented switch with six tools, including Stash and .gitignore.
zh_hans: 工具页:提供含「贮藏」与「.gitignore」在内的六个工具的分段切换。
zh_hk: 工具頁:提供含「貯藏」與「.gitignore」在內的六個工具的分段切換。

source: Total Commits
zh_hans: 总提交数
zh_hk: 總提交數

source: Track
zh_hans: 跟踪
zh_hk: 追蹤

source: Track and fetch large files.
zh_hans: 跟踪并获取大文件。
zh_hk: 追蹤並擷取大型檔案。

source: Unable to Get Git Information
zh_hans: 无法获取 Git 信息
zh_hk: 無法獲取 Git 資訊

source: Uncommitted Changes
zh_hans: 有未提交更改
zh_hk: 有未提交更改

source: Uncommitted files: %lld
zh_hans: 未提交的文件：%lld
zh_hk: 未提交的檔案：%lld

source: Update
zh_hans: 更新
zh_hk: 更新

source: Update all
zh_hans: 全部更新
zh_hk: 全部更新

source: User Manual
zh_hans: 使用手册
zh_hk: 使用手冊

source: View and edit the ignore rules of the repository.
zh_hans: 查看并编辑仓库的忽略规则。
zh_hk: 檢視並編輯儲存庫的忽略規則。

source: View the commit history in the History sidebar; the current working state is shown at the top.
zh_hans: 在历史侧栏查看提交历史;顶部显示当前工作状态。
zh_hk: 在歷史側欄查看提交歷史;頂部顯示目前工作狀態。

source: Where to Find It
zh_hans: 使用入口
zh_hk: 使用入口

source: Working State
zh_hans: 工作区状态
zh_hk: 工作區狀態

source: Working state (%lld)
zh_hans: 工作区 (%lld)
zh_hk: 工作區 (%lld)

source: Working tree has uncommitted changes
zh_hans: 工作区有未提交的更改
zh_hk: 工作區有未提交的更改
